#//////////////////////////////////////////////////////////////////////////////////
# AI_randomモジュール
# --------------------- インクルードされるクラス -----------------------------------
#   Com_randomクラス
# ---------------------------- 内容説明 ------------------------------------------
#   1手読み（ランダム打ち）に必要な関数を集めたモジュール
#//////////////////////////////////////////////////////////////////////////////////

module AI_random
  #################################################################################
  # 処理内容：
  #  石が置ける座標の中からランダムでひとつ返す
  # 戻り値：
  #  石が置ける座標の情報
  #  { point => 石が置ける座標, dir => 石が置ける向き }
  #################################################################################
  def select_point_info
    @logger.debug{ 'select_point_info start' }

    mobility_info = self.get_mobility_info

    r_info = mobility_info[rand(mobility_info.length)]
    @logger.debug{ 'select_point_info end : return ' + "\n" + r_info.pretty_inspect }
    return r_info
  end
end
