require 'logger'

#//////////////////////////////////////////////////////////////////////////////////
# Confクラス
# ------------------------   インスタンス変数   -----------------------------------
#   @log_file      ログファイルの場所
#   @log_rotate    ログローテーとの数
#   @log_level     ログのレベル
# ---------------------------- 内容説明 ------------------------------------------
#   設定ファイルの役目をするクラス
#   インスタンス変数の内容が設定内容である    
#//////////////////////////////////////////////////////////////////////////////////

class Conf
  def initialize
    @log_file      = 'log/reversi_random.log'
    @log_rotate    = 5
    @log_level     = Logger::DEBUG
  end

  attr_accessor :log_file, :log_rotate, :log_level
end
